3142430257/chendian/STM32G431CBT6_Motor/STM32G431CBT6_motor/App/app_control.c
/**
 * @file    app_control.c
 * @brief   系统状态机实现
 *
 * 状态转换：
 *   INIT → CALIBRATE（外设初始化完成）
 *   CALIBRATE → READY（零偏采集完成，编码器有效）
 *   READY → RUN（app_control_enable() 被调用）
 *   RUN/READY → FAULT（软件故障检测触发）
 *   FAULT → READY（手动复位，需先清除故障源）
 *
 * 软件保护（主循环 ~1kHz 检测）：
 *   VBUS < 8V 或 > 26V → FAULT_VBUS_LOW / FAULT_VBUS_HIGH
 *   温度超限             → FAULT_TEMP
 *   编码器信号丢失       → FAULT_ENCODER
 *   任一 ADC 通道饱和    → FAULT_ADC_SATURATE
 */

#include "app_control.h"
#include "board_config.h"
#include "foc_interface.h"
#include "encoder_if.h"
#include "mpu6050.h"
#include "stm32g4xx_hal.h"
#include <string.h>
#include <math.h>   /* logf(), fmaxf(), fminf() */

/* ============================================================
 * 速度环参数（经验证稳定，平滑优先于响应速度）
 * ============================================================ */
#define KP_SPD          (0.10f)    /* A/(rad/s) */
#define KI_SPD          (0.05f)    /* A/rad：KI/KP=0.5，防振荡 */
#define IQ_MAX_A        (0.80f)    /* A */
#define OMEGA_SLEW_RATE (2.0f)     /* rad/s² */
#define SPEED_EST_ALPHA (0.15f)    /* IIR alpha：恢复稳定值 */
#define SPEED_EST_DT_MS (20U)      /* 20ms估算间隔 */
#define FRICTION_FF_A   (0.05f)    /* 摩擦前馈：克服静摩擦 */
#define TWO_PI          (6.28318530f)

/* 外部 GPIO（CubeMX 在 gpio.c 生成）*/
extern void MX_GPIO_Init(void);  /* 仅供参考，实际已由 main 调用 */

/* ============================================================
 * 内部状态
 * ============================================================ */
static AppState_t s_state = STATE_INIT;
static uint8_t    s_fault = FAULT_NONE;
static volatile float s_iq_ref_a = 0.0f;  /* q轴目标电流 [A]，主循环写、ISR 读 */

/* --- 速度环状态 --- */
static float    s_theta_prev_rad = 0.0f;   /* 上次机械角 [rad] */
static uint32_t s_est_prev_ms    = 0;      /* 上次估算时刻 [ms] */
static float    s_omega_est_rps  = 0.0f;   /* 滤波后速度 [rad/s] */
static float    s_omega_ref_rps  = 0.0f;   /* 经斜坡后的速度目标 [rad/s] */
static float    s_omega_ref_cmd  = 0.0f;   /* 用户目标（未经斜坡）[rad/s] */
static float    s_speed_integ    = 0.0f;   /* PI 积分项 */
static bool     s_speed_mode     = false;  /* true=速度模式, false=力矩模式 */

/* --- 位置环状态 --- */
static CtrlMode_t s_ctrl_mode           = CTRL_SPEED;
static float      s_pos_home_offset_deg = 0.0f;   /* 回零时的编码器角 [deg] */
static float      s_pos_target_deg      = 0.0f;   /* 位置目标 [deg]，已clamp到±90° */
static float      s_vel_filt_dps        = 0.0f;   /* D项速度滤波 [°/s]，MOTOR_SIGN坐标系 */
static float      s_kp_pos              = 1.0f;   /* 位置P增益 [°/s 每 °误差]（实测稳定值）*/
static float      s_kd_pos              = 0.02f;  /* 位置D增益（用滤波速度，实测稳定值）*/
static float      s_pos_spd_lim_dps     = 45.0f;  /* 位置环输出速度限幅 [°/s]（实测稳定值）*/
static float      s_pos_deadband_deg    = 0.5f;   /* 位置死区 [deg] */
static float      s_stab_lim_deg        = 10.0f;  /* 自稳目标软限幅 [°]，默认10°，第G命令前可用 GLIM<val> 调大 */
static float      s_imu_home_offset_deg  = 0.0f;  /* IMU pitch 安装偏置，H 命令时刷新 */

/* 零偏采样窗口 */
#define CALIB_SAMPLES   (256U)
static uint32_t s_calib_sum_iu = 0;
static uint32_t s_calib_sum_iv = 0;
static uint32_t s_calib_sum_iw = 0;
static uint16_t s_calib_cnt    = 0;
static uint32_t last_frame_cnt = 0;

/* 前向声明（定义在文件尾部）*/
static void align_update(const FocMeasurement_t *m);

/* ── 位置环抖助函数 ── */

/* 角度迹化到 -180∼+180° */
static float wrap180(float x)
{
    while (x >  180.0f) x -= 360.0f;
    while (x < -180.0f) x += 360.0f;
    return x;
}

/* 获取相对 home 的实际角（带 MOTOR_SIGN）[deg] */
static float get_pos_actual_deg(void)
{
    float raw_deg = encoder_get_angle_rad() * (180.0f / 3.14159265f);
    return MOTOR_SIGN * wrap180(raw_deg - s_pos_home_offset_deg);
}

/* ---------------------------------------------------------- */
static void ctrl_sd_set(bool enable)
{
    GPIO_PinState pin = enable ? GPIO_PIN_SET : GPIO_PIN_RESET;
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_12, pin);
}

/* ============================================================
 * 软件故障检测
 * ============================================================ */
static uint8_t check_faults(const FocMeasurement_t *m, const uint16_t *adc_raw)
{
    uint8_t f = FAULT_NONE;

    /* VBUS */
    if (m->vbus_v < VBUS_MIN_V)  f |= FAULT_VBUS_LOW;
    if (m->vbus_v > VBUS_MAX_V)  f |= FAULT_VBUS_HIGH;

    /* 编码器 — 暂时禁用：EMI 导致虚假触发，后续加更宽松的去抖 */
    // if (!encoder_is_valid())      f |= FAULT_ENCODER;

    /* ADC 饱和（任意通道）*/
    for (uint8_t i = 0; i < FOC_ADC_CH_COUNT; i++) {
        if (adc_raw[i] == 0U || adc_raw[i] == 4095U) {
            f |= FAULT_ADC_SATURATE;
            break;
        }
    }

    /* 温度：NTC B 参数法换算（NCP18XH103，10K@25C，B=3380K）
     * 分压电路：VCC3.3 → NTC(Rt) → VTEMP → 4.7k → GND
     * 正确公式：Rt = 4.7 * (Vcc - Vadc) / Vadc
     * 1/T = 1/T0 + ln(Rt/R0) / B  (T0=298.15K, R0=10kOhm) */
    {
        float vadc_t = ADC_TO_VOLT(adc_raw[FOC_ADC_IDX_VTEMP]);
        if (vadc_t > 0.01f) {   /* 防止除零（NTC 短路时 Vadc ≈ 0）*/
            float rt_k   = VTEMP_PULLUP_K * (ADC_REF_V - vadc_t) / vadc_t;
            float ln_r   = logf(rt_k / VTEMP_NTC_25C_K);
            float temp_k = 1.0f / (1.0f / 298.15f + ln_r / VTEMP_NTC_B);
            float temp_c = temp_k - 273.15f;
            if (temp_c > VTEMP_TEMP_LIMIT_C) {
                f |= FAULT_TEMP;
            }
        } else {
            /* Vadc ≈ 0：NTC 短路（波在上极高温）——视为温度异常 */
            f |= FAULT_TEMP;
        }
    }

    return f;
}

/* ============================================================
 * 公共接口
 * ============================================================ */
void app_control_init(void)
{
    s_state      = STATE_INIT;
    s_fault      = FAULT_NONE;
    s_iq_ref_a   = 0.0f;      /* 确保上电时 Iq 指令为零 */
    s_calib_cnt  = 0;
    s_calib_sum_iu = s_calib_sum_iv = s_calib_sum_iw = 0;
    last_frame_cnt = foc_interface_get_frame_count();

    /* 校准必须在驱动禁用状态下进行，确保零电流。
     * CTRL_SD 拉低 → 栅极驱动器关闭 → MOSFET 全关 → 相电流 = 0。
     * 此时 ADC 读到的是运放 1.25V 偏置电压，对应理论值 ~1551。
     * ISR 仍在运行但 Simulink 输出不影响实际电流（MOSFET 已关断）。*/
    ctrl_sd_set(false);
    foc_interface_write_ccr(0.5f, 0.5f, 0.5f);  /* 零电压输出 */
    s_state = STATE_CALIBRATE;
}

void app_control_update(void)
{
    FocMeasurement_t meas;
    foc_interface_get_measurement(&meas);

